/* 
  SBXErrors.strings
  Secrets

  Created by Paulo Andrade on 9/25/12.

*/

"UnexpectedError.errorDescription" = "Unexpected error";
"UnexpectedError.failureReason" = "We're sorry but the operation failed due to an unexpected error. Please contact support if the problem persists.";

"ModelInvalidProperty.errorDescription" = "Invalid value";
"ModelInvalidProperty.failureReason" = "A %@ %@ must be a %@";

"DataStoreIncompatibleMasterKeyError.errorDescription" = "Incompatible master key";
"DataStoreIncompatibleMasterKeyError.failureReason" = "This document's master key failed validation.";

"DataStoreMustBeUnlockedError.errorDescription" = "Data store locked";
"DataStoreMustBeUnlockedError.failureReason" = "Data store must be unlocked to perform this operation.";

"DataStoreNotPassphraseProtectedError.errorDescription" = "Data store unprotected";
"DataStoreNotPassphraseProtectedError.failureReason" = "Data store isn't passphrase protected yet.";

"DataStoreCorruptedError.errorDescription" = "Document is invalid";
"DataStoreCorruptedError.failureReason" = "Could not open the document, it might be corrupted.";

"DataStoreURLNotSetError.errorDescription" = "Store URL not set";
"DataStoreURLNotSetError.failureReason" = "Store URL must be set prior to performing this operation";

"DataStoreSynchronizationFailedError.errorDescription" = "Synchronization failed";
"DataStoreSynchronizationFailedError.failureReason" = "Synchronization failed due to an unexpected error.";

"DataStoreIncorrectPassphraseError.errorDescription" = "Incorrect passphrase";
"DataStoreIncorrectPassphraseError.failureReason" = "Failed to unlock data store with the given passphrase";

"DataStoreMigrationUnknownModelError.errorDescription" = "Update required";
/*
 * The %@ will be replaced by the application name. Example:
 * It seems your data was saved using a more recent version of Secrets.
*/
"DataStoreMigrationUnknownModelError.failureReason" = "It seems your data was saved using a more recent version of %@.";
/*
 * The %@ will be replaced by the application name. Example:
 * It seems your data was saved using a more recent version of Secrets. Please update to the latest version and try again.
*/
"DataStoreMigrationUnknownModelError.recoverySuggestion" = "It seems your data was saved using a more recent version of %@. Please update to the latest version and try again.";

"DataStoreMigrationSourceMetadataError.errorDescription" = "Unkown file format";
"DataStoreMigrationSourceMetadataError.failureReason" = "Failed to identify file format";

"NetworkConnectionVersionMismatchError.errorDescription" = "Version mismatch";
"NetworkConnectionVersionMismatchError.failureReason" = "The device you're trying to connect to is running an incompatible version. Please make sure your software is updated.";

"NetworkConnectionInterruptedError.errorDescription" = "Connection failed";
"NetworkConnectionInterruptedError.failureReason" = "The connection has been interrupted for some unknown reason.";

"NetworkConnectionBadRequestError.errorDescription" = "Connection failed";
"NetworkConnectionBadRequestError.failureReason" = "The connection has been interrupted due to a bad request.";

"NetworkConnectionInternalError.errorDescription" = "Connection failed";
"NetworkConnectionInternalError.failureReason" = "Connection failed due to an internal error";

"NetworkConnectionUnauthorizedRequestError.errorDescription" = "Connection failed";
"NetworkConnectionUnauthorizedRequestError.failureReason" = "The connection has been interrupted due to an unauthorized request.";

"NetworkConnectionFailedError.errorDescription" = "Connection failed";
"NetworkConnectionFailedError.failureReason" = "Failed to establish a connection with peer. Please verify WiFi and Bluetooth settings.";

"NetworkConnectionTimedOutError.errorDescription" = "Connection timed out";
"NetworkConnectionTimedOutError.failureReason" = "Failed to establish a connection in a reasonable amount of time.";

"OperationCancelledError.errorDescription" = "Operation cancelled";
"OperationCancelledError.failureReason" = "Cancelled operation as per your request.";

"OperationTimedOutError.errorDescription" = "Operation timed out";
"OperationTimedOutError.failureReason" = "Operation failed to finish in a reasonable amount of time.";

"UbiquitousSyncNotEnabledError.errorDescription" = "iCloud Sync disabled";
"UbiquitousSyncNotEnabledError.failureReason" = "iCloud Sync must be enabled to perform this operation.";

"UbiquitousSyncIdentifierDiffersError.errorDescription" = "iCloud Sync mismatch";
"UbiquitousSyncIdentifierDiffersError.failureReason" = "Data stored in iCloud appears to be from a different user. You may have switched to a different iCloud user since first enabling iCloud Sync.";

"UbiquitousStoreUnlockableError.errorDescription" = "Could not sync with iCloud";
"UbiquitousStoreUnlockableError.failureReason" = "Could not unlock iCloud data, your passphrase may have changed.";
"UbiquitousStoreUnlockableError.recoverySuggestion" = "If you have changed your passphrase on another device, update your passphrase here to use iCloud Sync.";

"UbiquitousStoreUnprotectedError.errorDescription" = "iCloud store isn't passphrase protected";
"UbiquitousStoreUnprotectedError.failureReason" = "Aborting iCloud sync because store isn't protected with any passphrase";

"PairingFailedError.errorDescription" = "Pairing failed";
"PairingFailedError.failureReason" = "Could not complete pairing with peer.";

"PairingDeniedError.errorDescription" = "Pairing denied";
"PairingDeniedError.failureReason" = "Peer denied pairing request.";

"SyncingFailedError.errorDescription" = "Sync failed";
"SyncingFailedError.failureReason" = "Could not complete sync operation.";

"PersistentStoreLockedError.errorDescription" = "Store is being used";
"PersistentStoreLockedError.failureReason" = "Try the operation again in a moment.";

"UnsuportedDocumenTypeError.errorDescription" = "Unsuported document type";
"UnsuportedDocumenTypeError.failureReason" = "The document requested is not supported.";

"WrongDocumentPassphraseError.errorDescription" = "Wrong passphrase";
"WrongDocumentPassphraseError.failureReason" = "Could not open document with the provided passphrase.";

/*
 * The %@ will be replaced by another application name. Example:
 * 
 * Failed to communicate with Safari.
*/
"ScriptingBridgeError.errorDescription" = "Failed to communicate with %@";
"ScriptingBridgeError.failureReason" = "Failed to request %@ to perform the desired operation.";

"CouldNotSaveDocumentError.errorDescription" = "Could not save document";
"CouldNotSaveDocumentError.failureReason" = "An error occurred while trying to save your document.";

"SecureEnclaveNotAvailableError.errorDescription" = "Device authentication not available";
"SecureEnclaveNotAvailableError.failureReason" = "Your device must have a passcode or Touch ID enabled to use this feature";

"IACError.UnsupportedCallback" = "'%@' is not an x-callback-url action supported by %@";
"IACError.UnsupportedScheme" = "App with scheme '%@' is not installed in this device";

"SyncMissingPremium.errorDescription" = "Sync disabled";
"SyncMissingPremium.failureReason" = "Upgrade to Premium to continue syncing with more than %d items";

"ImportMissingPremium.errorDescription" = "Import hit Free item limit";
"ImportMissingPremium.failureReason" = "The Free version is limited to %d items. Please upgrade and import this file again.";
